This is used to post error. The sum of bar engagements is greater than the total coupler length.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
 Syntax
  C#
public static FailureDefinitionId EngagementBiggerThanLengthError { get; }
  Visual Basic
Public Shared ReadOnly Property EngagementBiggerThanLengthError As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ EngagementBiggerThanLengthError {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures RebarCouplerFailures Class
  Autodesk.Revit.DB Namespace